tsung_logs/testing/app_v1_user_friend/20211128-0102/tsung_user_friend.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="20000" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="yon01.eba-fz2dfqnp.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
</load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
  </options>

  <sessions>

    <session name="user friend" weight="1" type="ts_http">

        <request>
            <dyn_variable name="authenticity_token"/>
            <http url="/d/users/sign_in/" version="1.1" method="GET"/>
         </request>

        <thinktime value="2" random="true"/>

        <setdynvars sourcetype="random_number" start="1" end="100">
            <var name="random_num"/>
        </setdynvars>

        <setdynvars code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global,{return,list}]) end." sourcetype="eval">
          <var name="encoded_authenticity_token"/>
        </setdynvars>

        <if var="encoded_authenticity_token" neq="">
          <request subst="true">
              <http url="/d/users/sign_in/" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;user%5Bemail%5D=user_%%_random_num%%%40gmail.com&amp;user%5Bpassword%5D=Password1234&amp;user%5Bremember_me%5D=0&amp;commit=Log+in">
              </http>
          </request>
        </if>
        
    
        <request>
          <dyn_variable name="users_authenticity_token" xpath="//head/meta[@name='csrf-token']/@content"/>
          <dyn_variable name="friend_num_url" xpath="/html/body/div/div/div/div/a[@data-method=&quot;post&quot;]/@href"/> 
          <http url="/users/" version="1.1" method="GET"/>
        </request>

        <setdynvars code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(users_authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global,{return,list}]) end." sourcetype="eval">
          <var name="encoded_users_authenticity_token"/>
        </setdynvars>

        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->           {ok,Val}=ts_dynvars:lookup(friend_num_url,DynVars),           lists:last(Val) end.">
          <var name="last_friend_num_url"/>
        </setdynvars>
      
        <if var="encoded_authenticity_token" neq="">
          <request subst="true">
              <http url="/%%_last_friend_num_url%%/" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="_method=post&amp;authenticity_token=%%_encoded_users_authenticity_token%%">
              </http>
          </request>
        </if>

        <thinktime value="2" random="true"/>
        <request>
          <dyn_variable name="users_profile_authenticity_token" xpath="//head/meta[@name='csrf-token']/@content"/>
          <dyn_variable name="delete_friend_url" xpath="/html/body//div[@class='card-body']/h5/a/@href"/>
          <http url="/users/profile/" version="1.1" method="GET"/>
        </request>

        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->           {ok,Val}=ts_dynvars:lookup(delete_friend_url,DynVars),           lists:last(Val) end.">
        <var name="last_delete_friend_url"/>
        </setdynvars>

        <setdynvars code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(users_profile_authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global,{return,list}]) end." sourcetype="eval">
          <var name="encoded_users_profile_authenticity_token"/>
        </setdynvars>

        <if var="encoded_users_profile_authenticity_token" neq="">
          <request subst="true">
              <http url="/%%_last_delete_friend_url%%/" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="_method=delete&amp;authenticity_token=%%_encoded_users_profile_authenticity_token%%">
              </http>
          </request>
        </if>


        <request>
          <dyn_variable name="authenticity_token_logout" xpath="//head/meta[@name='csrf-token']/@content"/>
          <http url="/users/profile" version="1.1" method="GET"/>
        </request>

        <setdynvars code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token_logout,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global,{return,list}]) end." sourcetype="eval">
          <var name="encoded_authenticity_token_logout"/>
        </setdynvars>

        <if var="encoded_authenticity_token_logout" neq="">
          <request subst="true">
              <http url="/d/users/sign_out" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="_method=delete&amp;authenticity_token=%%_encoded_authenticity_token_logout%%">
              </http>
          </request>
        </if>
      

        
        
    </session>
    
  </sessions>
</tsung>